cohomology.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-04 Sun 20:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cohomology</title>
<meta name="author" content="Vaibhav Karve" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Cohomology</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgba65fee">1. Categories</a>
<ul>
<li><a href="#org4ae02dc">1.1. Tensor and exterior algebras</a></li>
<li><a href="#org360ceb8">1.2. Topological manifold</a></li>
</ul>
</li>
</ul>
</div>
</div>
<dl class="org-dl">
<dt>Reference</dt><dd>Bott and Tu's Differential forms in algebraic topology</dd>
<dt>Context</dt><dd>these are notes taken from attending a reading group in
Fall 2020.</dd>
</dl>

<div id="outline-container-orgba65fee" class="outline-2">
<h2 id="orgba65fee"><span class="section-number-2">1.</span> Categories</h2>
<div class="outline-text-2" id="text-1">
<p>
Let \(A\) be a ring. Category \(Mod_A\) is the catergory with objects being
left \(A\)-modules and morphims are \(A\)-linear maps.
</p>

<p>
<span class="underline">Example of functor</span>: π₀ : Top → Set is the functor that gives the
connected components of a topological space X. It sends X ↦ X/~ where
x~y iff ∃ a path from x to y.
</p>

<p>
<span class="underline">Natural transformations</span>: Let C and D be to categories. Let F : C → D
be a functor. Let G : D → C be another functor. Then a <i>natural
transformation</i> is a map α : F → G such that for every f : x ↦ y,
</p>

<p>
F(x) → α(F(x))
↓ F(f)   ↓α(F(f))
F(y) → α(F(y))
</p>

<p>
this square commutes.
</p>

<p>
Let X ∈ Top. Open(X) = open sets of X with partial order
(inclusion). Open(X) is itself a category where the objects are the
open sets and morphisms are Hom(U, V) = ∅ if ¬ (U ⊆ V) else ⋆, where ⋆
is a single morphism.
</p>

<p>
Presheaves(X) = Fun(Open(X)ᵒᵖ, Set) is then a category with objects =
Open(X)ᵒᵖ → Set and morphisms are natural transformations.
</p>

<p>
<span class="underline">Exact sequence</span>:
</p>
<ul class="org-ul">
<li>co-chain complex condition</li>
<li>Ker f<sup>n</sup> = Im f<sup>n+1</sup></li>
</ul>

<p>
<span class="underline">Short exact sequence</span>:
</p>

<p>
0 → M → N → P → 0
       α    β
</p>

<p>
If this is an exact sequence then, we can conclude the following:
</p>
<ul class="org-ul">
<li>β is surjective</li>
<li>α is injective</li>
<li>β∘α = 0</li>
<li>P ≅ N/M</li>
</ul>
</div>

<div id="outline-container-org4ae02dc" class="outline-3">
<h3 id="org4ae02dc"><span class="section-number-3">1.1.</span> Tensor and exterior algebras</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Let M be an A-module. (M is free : e₁, &#x2026;, eₙ).
</p>

<p>
T*(M) := the universal graded associative A-algebra with a map M → T*(M).
      = A ⊕ M ⊕ (M⊗M) ⊕ (M⊗M⊗M) ⊕ &#x2026;
</p>

<p>
Λ*(M) := the universal graded associative graded commutative A-algebra
      = A ⊕ M ⊕ A{e<sub>i</sub> ∧ e<sub>j</sub> | i&lt;j} ⊕ A{e<sub>i</sub> ∧ e<sub>j</sub> ∧ e<sub>k</sub> | &#x2026;} ⊕ &#x2026;
</p>
</div>
</div>

<div id="outline-container-org360ceb8" class="outline-3">
<h3 id="org360ceb8"><span class="section-number-3">1.2.</span> Topological manifold</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A topological space X is
</p>
<ul class="org-ul">
<li>locally homeomorphic to ℝ<sup>n</sup>.</li>
<li>Hausdorff</li>
<li>2nd countable</li>
</ul>

<p>
Top.manifolds need not be smooth. Can have a smooth top.mani be
homeomorphic to a non-smooth top.mani.
</p>

<p>
Non-example: a top-space with a self-intersection.
</p>

<p>
<span class="underline">Smooth charts and atlases</span>: &#x2026;
</p>

<p>
Smooth manifold is a topological manifold together with a smooth atlas.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2024-02-04 Sun 20:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>